<?php

$lang["valid_url"] = "Поле %s должно содержать действительный URL.";  
$lang["required"] = "Поле %s является обязательным.";  
$lang["isset"] = "Поле %s должно иметь значение.";  
$lang["valid_email"] = "Поле %s должно содержать действительный адрес электронной почты.";  
$lang["valid_emails"] = "Поле %s должно содержать все действующие адреса электронной почты.";  
$lang["valid_ip"] = "Поле %s должно содержать действительный IP-адрес.";  
$lang["min_length"] = "Поле %s должно содержать не менее %s символов.";
$lang["max_length"] = "Поле %s не может превышать %s символов в длину.";
$lang["exact_length"] = "Поле %s должно содержать ровно %s символов.";
$lang["alpha"] = "Поле %s может содержать только алфавитные символы.";  
$lang["alpha_numeric"] = "Поле %s может содержать только буквенно-цифровые символы.";  
$lang["alpha_dash"] = "Поле %s может содержать только буквенно-цифровые символы, подчеркивания и дефисы.";  
$lang["numeric"] = "Поле %s должно содержать только числа.";  
$lang["is_numeric"] = "Поле %s должно содержать только числовые символы.";  
$lang["integer"] = "Поле %s должно содержать целое число.";  
$lang["regex_match"] = "Поле %s имеет неправильный формат.";  
$lang["matches"] = "Поле %s не соответствует полю %s.";
$lang["is_unique"] = "Поле %s должно содержать уникальное значение.";  
$lang["is_natural"] = "Поле %s должно содержать только положительные числа.";  
$lang["is_natural_no_zero"] = "Поле %s должно содержать число больше нуля.";  
$lang["decimal"] = "Поле %s должно содержать десятичное число.";  
$lang["less_than"] = "Поле %s должно содержать число меньше %s.";
$lang["greater_than"] = "Поле %s должно содержать число больше %s.";
